
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 5 to change, 8 to destroy.</code></pre>

* Create
  * module.div-aos-overdue-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-bulk-print-config-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-bulkcase-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-data-extraction-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-fe-performance-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-server-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.divorce-action-group.azurerm_resource_group_template_deployment.action-group
  * module.divorce-action-group2.azurerm_resource_group_template_deployment.action-group
* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.div-vault.azurerm_key_vault.kv
  * module.div-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.div-vault.azurerm_key_vault_access_policy.product_team_access_policy
* Delete
  * module.div-aos-overdue-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-bulk-print-config-errors-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-bulkcase-errors-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-data-extraction-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-fe-performance-alert.azurerm_template_deployment.custom_alert[0]
  * module.div-server-errors-alert.azurerm_template_deployment.custom_alert[0]
  * module.divorce-action-group.azurerm_template_deployment.action-group
  * module.divorce-action-group2.azurerm_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.div_key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "div_key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "div-aat"
      + network_acls                    = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "div-aat"
      + sku_name                        = (known after apply)
      + soft_delete_enabled             = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Insights/components/div-aat"
        name                                  = "div-aat"
      ~ tags                                  = {
          - "Deployment Environment" = "aat" -> null
          - "Destroy Me"             = "No" -> null
          - "Team Contact"           = "#div-dev" -> null
          - "Team Name"              = "Divorce" -> null
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat"
        name     = "div-aat"
      ~ tags     = {
          - "Deployment Environment" = "aat" -> null
          - "Destroy Me"             = "No" -> null
          - "Team Name"              = "Divorce" -> null
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.div-aos-overdue-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be created
  + resource "azurerm_resource_group_template_deployment" "custom_alert" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "div-aos-overdue-alert"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + actionGroupName          = {
                  + value = "div-support2"
                }
              + actionGroupRg            = {
                  + value = "div-aat"
                }
              + alertDesc                = {
                  + value = "Logs indicate that daily job responsible for moving eligible cases to 'AOS Overdue' state did not run in div-aat."
                }
              + alertName                = {
                  + value = "div-aos-overdue-alert"
                }
              + appInsightsName          = {
                  + value = "div-aat"
                }
              + appInsightsQuery         = {
                  + value = "traces | where message == 'Running AosOverdueJob job'"
                }
              + commonTags               = {
                  + value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0="
                }
              + customEmailSubject       = {
                  + value = "Alert: AOS Overdue job does not seem to be working in div-aat"
                }
              + frequencyInMinutes       = {
                  + value = "300"
                }
              + location                 = {
                  + value = "UK South"
                }
              + severityLevel            = {
                  + value = "2"
                }
              + timeWindowInMinutes      = {
                  + value = "1440"
                }
              + triggerThreshold         = {
                  + value = "1"
                }
              + triggerThresholdOperator = {
                  + value = "LessThan"
                }
            }
        )
      + resource_group_name = "div-aat"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction   = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity     = "[parameters('severityLevel')]"
                              + status       = "Active"
                              + trigger      = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.div-aos-overdue-alert.azurerm_template_deployment.custom_alert[0] will be destroyed
  # (because azurerm_template_deployment.custom_alert is not in configuration)
  - resource "azurerm_template_deployment" "custom_alert" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-aos-overdue-alert" -> null
      - name                = "div-aos-overdue-alert" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "actionGroupName"          = "div-support2"
          - "actionGroupRg"            = "div-aat"
          - "alertDesc"                = "Logs indicate that daily job responsible for moving eligible cases to 'AOS Overdue' state did not run in div-aat."
          - "alertName"                = "div-aos-overdue-alert"
          - "appInsightsName"          = "div-aat"
          - "appInsightsQuery"         = "traces | where message == 'Running AosOverdueJob job'"
          - "customEmailSubject"       = "Alert: AOS Overdue job does not seem to be working in div-aat"
          - "frequencyInMinutes"       = "300"
          - "location"                 = "UK South"
          - "severityLevel"            = "2"
          - "timeWindowInMinutes"      = "1440"
          - "triggerThreshold"         = "1"
          - "triggerThresholdOperator" = "LessThan"
        } -> null
      - resource_group_name = "div-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName          = {
                      - type = "string"
                    }
                  - actionGroupRg            = {
                      - type = "string"
                    }
                  - alertDesc                = {
                      - type = "string"
                    }
                  - alertName                = {
                      - type = "string"
                    }
                  - appInsightsName          = {
                      - type = "string"
                    }
                  - appInsightsQuery         = {
                      - type = "string"
                    }
                  - customEmailSubject       = {
                      - type = "string"
                    }
                  - frequencyInMinutes       = {
                      - defaultValue = "5"
                      - type         = "string"
                    }
                  - location                 = {
                      - type = "string"
                    }
                  - severityLevel            = {
                      - defaultValue = "3"
                      - type         = "string"
                    }
                  - timeWindowInMinutes      = {
                      - defaultValue = "5"
                      - type         = "string"
                    }
                  - triggerThreshold         = {
                      - type = "string"
                    }
                  - triggerThresholdOperator = {
                      - allowedValues = [
                          - "GreaterThan",
                          - "Equal",
                          - "LessThan",
                        ]
                      - defaultValue  = "GreaterThan"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-09-01-preview"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('alertName')]"
                      - properties = {
                          - action      = {
                              - aznsAction   = {
                                  - actionGroup  = [
                                      - "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  - emailSubject = "[parameters('customEmailSubject')]"
                                }
                              - "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              - severity     = "[parameters('severityLevel')]"
                              - status       = "Active"
                              - trigger      = {
                                  - consecutiveBreach = 1
                                  - threshold         = "[parameters('triggerThreshold')]"
                                  - thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          - description = "[parameters('alertDesc')]"
                          - enabled     = "true"
                          - schedule    = {
                              - frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              - timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          - skuType     = "L1"
                          - source      = {
                              - dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              - query        = "[parameters('appInsightsQuery')]"
                              - queryType    = "ResultCount"
                            }
                        }
                      - tags       = {
                          - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                        }
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
            }
        ) -> null

      - timeouts {}
    }

  # module.div-bulk-print-config-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be created
  + resource "azurerm_resource_group_template_deployment" "custom_alert" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "div-bulk-print-config-errors-alert"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + actionGroupName          = {
                  + value = "div-support2"
                }
              + actionGroupRg            = {
                  + value = "div-aat"
                }
              + alertDesc                = {
                  + value = "Logs indicate that the bulk print task has been misconfigured in div-aat."
                }
              + alertName                = {
                  + value = "div-bulk-print-config-errors-alert"
                }
              + appInsightsName          = {
                  + value = "div-aat"
                }
              + appInsightsQuery         = {
                  + value = "traces | where message startswith 'Bulk print for case ' and message has 'is misconfigured.'"
                }
              + commonTags               = {
                  + value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0="
                }
              + customEmailSubject       = {
                  + value = "Alert: Bulk print task seems to be misconfigured in div-aat"
                }
              + frequencyInMinutes       = {
                  + value = "720"
                }
              + location                 = {
                  + value = "UK South"
                }
              + severityLevel            = {
                  + value = "2"
                }
              + timeWindowInMinutes      = {
                  + value = "1440"
                }
              + triggerThreshold         = {
                  + value = "0"
                }
              + triggerThresholdOperator = {
                  + value = "GreaterThan"
                }
            }
        )
      + resource_group_name = "div-aat"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location        

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

timestamp)) !between (1 .. 5) or url !contains '-aat'"
          - "customEmailSubject"       = "Alert: server errors in div-aat"
          - "frequencyInMinutes"       = "5"
          - "location"                 = "UK South"
          - "severityLevel"            = "2"
          - "timeWindowInMinutes"      = "5"
          - "triggerThreshold"         = "20"
          - "triggerThresholdOperator" = "GreaterThan"
        } -> null
      - resource_group_name = "div-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName          = {
                      - type = "string"
                    }
                  - actionGroupRg            = {
                      - type = "string"
                    }
                  - alertDesc                = {
                      - type = "string"
                    }
                  - alertName                = {
                      - type = "string"
                    }
                  - appInsightsName          = {
                      - type = "string"
                    }
                  - appInsightsQuery         = {
                      - type = "string"
                    }
                  - customEmailSubject       = {
                      - type = "string"
                    }
                  - frequencyInMinutes       = {
                      - defaultValue = "5"
                      - type         = "string"
                    }
                  - location                 = {
                      - type = "string"
                    }
                  - severityLevel            = {
                      - defaultValue = "3"
                      - type         = "string"
                    }
                  - timeWindowInMinutes      = {
                      - defaultValue = "5"
                      - type         = "string"
                    }
                  - triggerThreshold         = {
                      - type = "string"
                    }
                  - triggerThresholdOperator = {
                      - allowedValues = [
                          - "GreaterThan",
                          - "Equal",
                          - "LessThan",
                        ]
                      - defaultValue  = "GreaterThan"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-09-01-preview"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('alertName')]"
                      - properties = {
                          - action      = {
                              - aznsAction   = {
                                  - actionGroup  = [
                                      - "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  - emailSubject = "[parameters('customEmailSubject')]"
                                }
                              - "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              - severity     = "[parameters('severityLevel')]"
                              - status       = "Active"
                              - trigger      = {
                                  - consecutiveBreach = 1
                                  - threshold         = "[parameters('triggerThreshold')]"
                                  - thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          - description = "[parameters('alertDesc')]"
                          - enabled     = "true"
                          - schedule    = {
                              - frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              - timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          - skuType     = "L1"
                          - source      = {
                              - dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              - query        = "[parameters('appInsightsQuery')]"
                              - queryType    = "ResultCount"
                            }
                        }
                      - tags       = {
                          - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                        }
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
            }
        ) -> null

      - timeouts {}
    }

  # module.div-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat"
        name                            = "div-aat"
      ~ purge_protection_enabled        = false -> true
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
            "application"         = "divorce"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#div-dev"
            "environment"         = "staging"
            "managedBy"           = "Divorce"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.div-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (7 unchanged elements hidden)
            "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
        ]
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.div-vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            # (10 unchanged elements hidden)
            "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat/objectId/f2ef9d16-488a-4b84-b433-3eb4225923cb"
      ~ key_permissions         = [
            # (4 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            # (2 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.div-vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "div-aat"
      + target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat"

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
    }

  # module.divorce-action-group.azurerm_resource_group_template_deployment.action-group will be created
  + resource "azurerm_resource_group_template_deployment" "action-group" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "div-support"
      + output_content      = (known after apply)
      + parameters_content  = (sensitive value)
      + resource_group_name = "div-aat"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName      = {
                      + type = "string"
                    }
                  + emailReceiverAddress = {
                      + metadata = {
                          + description = "Email address of the receiver"
                        }
                      + type     = "string"
                    }
                  + emailReceiverName    = {
                      + metadata = {
                          + description = "Name of the email receiver"
                        }
                      + type     = "string"
                    }
                  + location             = {
                      + defaultValue = "global"
                      + type         = "string"
                    }
                  + shortName            = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-04-01"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('actionGroupName')]"
                      + properties = {
                          + emailReceivers   = [
                              + {
                                  + emailAddress = "[parameters('emailReceiverAddress')]"
                                  + name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          + enabled          = true
                          + groupShortName   = "[parameters('shortName')]"
                          + smsReceivers     = []
                          + webhookReceivers = []
                        }
                      + tags       = {}
                      + type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        )
    }

  # module.divorce-action-group.azurerm_template_deployment.action-group will be destroyed
  # (because azurerm_template_deployment.action-group is not in configuration)
  - resource "azurerm_template_deployment" "action-group" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-support_aat" -> null
      - name                = "div-support_aat" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "actionGroupName"      = "div-support"
          - "emailReceiverAddress" = "div-support@hmcts.net"
          - "emailReceiverName"    = "Divorce Support Mailing List"
          - "location"             = "global"
          - "shortName"            = "div-support"
        } -> null
      - resource_group_name = "div-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName      = {
                      - type = "string"
                    }
                  - emailReceiverAddress = {
                      - metadata = {
                          - description = "Email address of the receiver"
                        }
                      - type     = "string"
                    }
                  - emailReceiverName    = {
                      - metadata = {
                          - description = "Name of the email receiver"
                        }
                      - type     = "string"
                    }
                  - location             = {
                      - defaultValue = "global"
                      - type         = "string"
                    }
                  - shortName            = {
                      - type = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-04-01"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('actionGroupName')]"
                      - properties = {
                          - emailReceivers   = [
                              - {
                                  - emailAddress = "[parameters('emailReceiverAddress')]"
                                  - name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          - enabled          = true
                          - groupShortName   = "[parameters('shortName')]"
                          - smsReceivers     = []
                          - webhookReceivers = []
                        }
                      - tags       = {}
                      - type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        ) -> null

      - timeouts {}
    }

  # module.divorce-action-group2.azurerm_resource_group_template_deployment.action-group will be created
  + resource "azurerm_resource_group_template_deployment" "action-group" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "div-support2"
      + output_content      = (known after apply)
      + parameters_content  = (sensitive value)
      + resource_group_name = "div-aat"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName      = {
                      + type = "string"
                    }
                  + emailReceiverAddress = {
                      + metadata = {
                          + description = "Email address of the receiver"
                        }
                      + type     = "string"
                    }
                  + emailReceiverName    = {
                      + metadata = {
                          + description = "Name of the email receiver"
                        }
                      + type     = "string"
                    }
                  + location             = {
                      + defaultValue = "global"
                      + type         = "string"
                    }
                  + shortName            = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-04-01"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('actionGroupName')]"
                      + properties = {
                          + emailReceivers   = [
                              + {
                                  + emailAddress = "[parameters('emailReceiverAddress')]"
                                  + name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          + enabled          = true
                          + groupShortName   = "[parameters('shortName')]"
                          + smsReceivers     = []
                          + webhookReceivers = []
                        }
                      + tags       = {}
                      + type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        )
    }

  # module.divorce-action-group2.azurerm_template_deployment.action-group will be destroyed
  # (because azurerm_template_deployment.action-group is not in configuration)
  - resource "azurerm_template_deployment" "action-group" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-support2_aat" -> null
      - name                = "div-support2_aat" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "actionGroupName"      = "div-support2"
          - "emailReceiverAddress" = "div-support@hmcts.net"
          - "emailReceiverName"    = "Divorce Support Mailing List2"
          - "location"             = "global"
          - "shortName"            = "div-support2"
        } -> null
      - resource_group_name = "div-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName      = {
                      - type = "string"
                    }
                  - emailReceiverAddress = {
                      - metadata = {
                          - description = "Email address of the receiver"
                        }
                      - type     = "string"
                    }
                  - emailReceiverName    = {
                      - metadata = {
                          - description = "Name of the email receiver"
                        }
                      - type     = "string"
                    }
                  - location             = {
                      - defaultValue = "global"
                      - type         = "string"
                    }
                  - shortName            = {
                      - type = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-04-01"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('actionGroupName')]"
                      - properties = {
                          - emailReceivers   = [
                              - {
                                  - emailAddress = "[parameters('emailReceiverAddress')]"
                                  - name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          - enabled          = true
                          - groupShortName   = "[parameters('shortName')]"
                          - smsReceivers     = []
                          - webhookReceivers = []
                        }
                      - tags       = {}
                      - type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        ) -> null
    }

Plan: 9 to add, 5 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":81,"Program":"tfcmt","SHA1":"","Vars":{}} -->